birhantprkc/esp-sr/test_apps/esp-sr-gsc-doa/sdkconfig.ci.p4_gsc_doa
# CI configuration for the GSC/DOA test on ESP32-P4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Custom partition table (app > 1MB due to embedded DOA test data)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n

# Tests run uninterrupted in the main task
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Bootloader exceeds the 0x6000 size limit at partition offset 0x8000 on esp32p4,
# so build it size-optimized and strip its logging output
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y

# Enable float printf
CONFIG_NEWLIB_NANO_FORMAT=n

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
